# Напишите программу, которая по заданному номеру четверти,
# показывает диапазон возможных координат точек в этой четверти (x и y).

n = int(input('Введите номер четверти: '))
if n == 1:
    print('0 <= x < +00; 0 <= y < +00')
elif n == 2:
    print('0 <= x < +00; 0 <= y < -00')
elif n == 3:
    print('0 <= x < -00; 0 <= y < -00')
elif n == 4:
    print('0 <= x < -00; 0 <= y < +00')
